## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_role_assignment.RBAC-AZTF-rg-audit-logs will be created
  + resource "azurerm_role_assignment" "RBAC-AZTF-rg-audit-logs" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "d653f4c9-8886-4423-841d-e968d83e9cfd"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Account Contributor"
      + scope                            = "/subscriptions/f34f6196-9ca8-445c-8e11-1db7ece881d4/resourceGroups/rg-aztf-logging-prod-ne-01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.RBAC-AZTFREAD-rg-audit-logs will be created
  + resource "azurerm_role_assignment" "RBAC-AZTFREAD-rg-audit-logs" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "60a8fcb7-ab3a-4139-81eb-1d08c600f0df"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Account Contributor"
      + scope                            = "/subscriptions/f34f6196-9ca8-445c-8e11-1db7ece881d4/resourceGroups/rg-aztf-logging-prod-ne-01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_storage_container.cont-insights-activity-logs will be created
  + resource "azurerm_storage_container" "cont-insights-activity-logs" {
      + container_access_type   = "private"
      + has_immutability_policy = (known after apply)
      + has_legal_hold          = (known after apply)
      + id                      = (known after apply)
      + metadata                = (known after apply)
      + name                    = "insights-activity-logs"
      + resource_manager_id     = (known after apply)
      + storage_account_name    = "miszelauditlogne01"
    }

  # azurerm_storage_container.cont-insights-operational-logs will be created
  + resource "azurerm_storage_container" "cont-insights-operational-logs" {
      + container_access_type   = "private"
      + has_immutability_policy = (known after apply)
      + has_legal_hold          = (known after apply)
      + id                      = (known after apply)
      + metadata                = (known after apply)
      + name                    = "insights-operational-logs"
      + resource_manager_id     = (known after apply)
      + storage_account_name    = "miszelauditlogne01"
    }

Plan: 4 to add, 0 to change, 0 to destroy.
```
</details>